
## Plan Result (prod)




<pre><code>Plan: 5 to add, 7 to change, 0 to destroy.</code></pre>

* Create
  * module.api_mgmt.azurerm_api_management_api.api
  * module.api_mgmt.azurerm_api_management_product_api.link_to_product[0]
  * module.api_mgmt_policy.azurerm_api_management_api_policy.api_policy
  * module.api_mgmt_product.azurerm_api_management_product.product
  * module.api_mgmt_product.azurerm_api_management_product_group.access_control_groups[&#34;developers&#34;]
* Update
  * azurerm_api_management_subscription.bulk_scan_team_subscription
  * azurerm_api_management_subscription.exela_supplier_subscription
  * azurerm_key_vault_secret.flexible_secret_standard_format[&#34;DATABASE&#34;]
  * azurerm_key_vault_secret.flexible_secret_standard_format[&#34;HOST&#34;]
  * azurerm_key_vault_secret.flexible_secret_standard_format[&#34;PASS&#34;]
  * azurerm_key_vault_secret.flexible_secret_standard_format[&#34;PORT&#34;]
  * azurerm_key_vault_secret.flexible_secret_standard_format[&#34;USER&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_api_management_subscription.bulk_scan_team_subscription will be updated in-place
  ~ resource "azurerm_api_management_subscription" "bulk_scan_team_subscription" {
      ~ allow_tracing       = false -> true
        id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.ApiManagement/service/cft-api-mgmt-prod/subscriptions/aa095961-15a6-44b2-aa2f-03a4746a6bd4"
        # (10 unchanged attributes hidden)
    }

  # azurerm_api_management_subscription.exela_supplier_subscription will be updated in-place
  ~ resource "azurerm_api_management_subscription" "exela_supplier_subscription" {
      ~ allow_tracing       = false -> true
        id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.ApiManagement/service/cft-api-mgmt-prod/subscriptions/7ef5607f-c124-4e0f-87ff-4b2aea54a3db"
        # (10 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret_standard_format["DATABASE"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret_standard_format" {
      ~ expiration_date         = "2026-09-26T10:37:28Z" -> (known after apply)
        id                      = "https://reform-scan-prod.vault.azure.net/secrets/blob-router-POSTGRES-DATABASE/8fcfcc7568314980a0d149fde7581330"
        name                    = "blob-router-POSTGRES-DATABASE"
        tags                    = {
            "application"         = "bulk-scan-print"
            "builtFrom"           = "https://github.com/HMCTS/blob-router-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "production"
            "managedBy"           = "Bulk Scanning and Printing"
            "source"              = "blob-router PostgreSQL"
        }
        # (7 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret_standard_format["HOST"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret_standard_format" {
      ~ expiration_date         = "2026-09-26T10:37:28Z" -> (known after apply)
        id                      = "https://reform-scan-prod.vault.azure.net/secrets/blob-router-POSTGRES-HOST/ed980219a91e4a53a32550c8b91bdffb"
        name                    = "blob-router-POSTGRES-HOST"
        tags                    = {
            "application"         = "bulk-scan-print"
            "builtFrom"           = "https://github.com/HMCTS/blob-router-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "production"
            "managedBy"           = "Bulk Scanning and Printing"
            "source"              = "blob-router PostgreSQL"
        }
        # (7 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret_standard_format["PASS"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret_standard_format" {
      ~ expiration_date         = "2026-09-26T10:37:28Z" -> (known after apply)
        id                      = "https://reform-scan-prod.vault.azure.net/secrets/blob-router-POSTGRES-PASS/8eb8d92035ca4a98b659a9592856d9a7"
        name                    = "blob-router-POSTGRES-PASS"
        tags                    = {
            "application"         = "bulk-scan-print"
            "builtFrom"           = "https://github.com/HMCTS/blob-router-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "production"
            "managedBy"           = "Bulk Scanning and Printing"
            "source"              = "blob-router PostgreSQL"
        }
        # (7 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret_standard_format["PORT"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret_standard_format" {
      ~ expiration_date         = "2026-09-26T10:37:28Z" -> (known after apply)
        id                      = "https://reform-scan-prod.vault.azure.net/secrets/blob-router-POSTGRES-PORT/625ba64f902c483f8454541197005db0"
        name                    = "blob-router-POSTGRES-PORT"
        tags                    = {
            "application"         = "bulk-scan-print"
            "builtFrom"           = "https://github.com/HMCTS/blob-router-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "production"
            "managedBy"           = "Bulk Scanning and Printing"
            "source"              = "blob-router PostgreSQL"
        }
        # (7 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret_standard_format["USER"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret_standard_format" {
      ~ expiration_date         = "2026-09-26T10:37:28Z" -> (known after apply)
        id                      = "https://reform-scan-prod.vault.azure.net/secrets/blob-router-POSTGRES-USER/3ee7881662a042839db61e23d65df6bb"
        name                    = "blob-router-POSTGRES-USER"
        tags                    = {
            "application"         = "bulk-scan-print"
            "builtFrom"           = "https://github.com/HMCTS/blob-router-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "production"
            "managedBy"           = "Bulk Scanning and Printing"
            "source"              = "blob-router PostgreSQL"
        }
        # (7 unchanged attributes hidden)
    }

  # module.api_mgmt.azurerm_api_management_api.api will be created
  + resource "azurerm_api_management_api" "api" {
      + api_management_name   = "cft-api-mgmt-prod"
      + api_type              = "http"
      + display_name          = "Bulk Scan API"
      + id                    = (known after apply)
      + is_current            = (known after apply)
      + is_online             = (known after apply)
      + name                  = "bulk-scan-api"
      + path                  = "bulk-scan"
      + protocols             = [
          + "http",
          + "https",
        ]
      + resource_group_name   = "cft-prod-network-rg"
      + revision              = "1"
      + service_url           = "http://reform-scan-blob-router-prod.service.core-compute-prod.internal"
      + soap_pass_through     = (known after apply)
      + subscription_required = true
      + version               = (known after apply)
      + version_set_id        = (known after apply)

      + import {
          + content_format = "openapi-link"
          + content_value  = "https://hmcts.github.io/cnp-api-docs/specs/blob-router-service.json"
        }

      + subscription_key_parameter_names (known after apply)
    }

  # module.api_mgmt.azurerm_api_management_product_api.link_to_product[0] will be created
  + resource "azurerm_api_management_product_api" "link_to_product" {
      + api_management_name = "cft-api-mgmt-prod"
      + api_name            = "bulk-scan-api"
      + id                  = (known after apply)
      + product_id          = "bulk-scan"
      + resource_group_name = "cft-prod-network-rg"
    }

  # module.api_mgmt_policy.azurerm_api_management_api_policy.api_policy will be created
  + resource "azurerm_api_management_api_policy" "api_policy" {
      + api_management_name = "cft-api-mgmt-prod"
      + api_name            = "bulk-scan-api"
      + id                  = (known after apply)
      + resource_group_name = "cft-prod-network-rg"
      + xml_content         = <<-EOT
            <policies>
              <inbound>
                <base />
                <validate-azure-ad-token header-name="Authorization" tenant-id="{tenant_id}" failed-validation-httpcode="401" failed-validation-error-message="Unauthorized. Access token is missing or invalid.">
                  <client-application-ids>
                    <application-id>{client_id}</application-id>
                  </client-application-ids>
                  <audiences>
                    <audience>{app_id}</audience>
                  </audiences>
                </validate-azure-ad-token>
              </inbound>
              <backend>
                <base />
              </backend>
              <outbound>
                <base />
              </outbound>
              <on-error>
                <base />
              </on-error>
            </policies>
        EOT
    }

  # module.api_mgmt_product.azurerm_api_management_product.product will be created
  + resource "azurerm_api_management_product" "product" {
      + api_management_name   = "cft-api-mgmt-prod"
      + approval_required     = false
      + display_name          = "bulk-scan"
      + id                    = (known after apply)
      + product_id            = "bulk-scan"
      + published             = true
      + resource_group_name   = "cft-prod-network-rg"
      + subscription_required = false
      + subscriptions_limit   = 20
    }

  # module.api_mgmt_product.azurerm_api_management_product_group.access_control_groups["developers"] will be created
  + resource "azurerm_api_management_product_group" "access_control_groups" {
      + api_management_name = "cft-api-mgmt-prod"
      + group_name          = "developers"
      + id                  = (known after apply)
      + product_id          = "bulk-scan"
      + resource_group_name = "cft-prod-network-rg"
    }

Plan: 5 to add, 7 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":2283,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->